In [4]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [26]:
df  = pd.DataFrame({"Company": ["Google","Google","Google","Microsoft","Microsoft","Microsoft", "Facebook", "Facebook","Facebook"], 
                    "Person" : ["Abhay","Balu", "Chirag","Abhay", "Chirag", "Balu", "Balu", "Abhay", "Chirag"],
                    "Sales" : abs(randn(9))*1000})

In [27]:
df

     Company  Person        Sales
0     Google   Abhay   332.876639
1     Google    Balu   283.189007
2     Google  Chirag   163.333446
3  Microsoft   Abhay   312.047889
4  Microsoft  Chirag  1009.162339
5  Microsoft    Balu   970.461584
6   Facebook    Balu    89.381853
7   Facebook   Abhay   202.080640
8   Facebook  Chirag   771.559514

In [28]:
df.groupby("Company").mean()

                Sales
Company
Facebook   354.340669
Google     259.799697
Microsoft  763.890604

In [29]:
df.groupby("Person").mean()

             Sales
Person
Abhay   282.335056
Balu    447.677481
Chirag  648.018433

In [30]:
df.groupby("Company").sum()

                 Sales
Company
Facebook   1063.022007
Google      779.399091
Microsoft  2291.671812

In [31]:
df.groupby("Person").sum()

              Sales
Person
Abhay    847.005168
Balu    1343.032444
Chirag  1944.055298

In [32]:
df.groupby("Company").mean().loc["Google"]

Sales    259.799697
Name: Google, dtype: float64

In [33]:
df.groupby("Company").count()

           Person  Sales
Company
Facebook        3      3
Google          3      3
Microsoft       3      3

In [34]:
df.groupby("Person").count()

        Company  Sales
Person
Abhay         3      3
Balu          3      3
Chirag        3      3

In [35]:
df.groupby(["Company", "Person"]).count()

                  Sales
Company   Person
Facebook  Abhay       1
          Balu        1
          Chirag      1
Google    Abhay       1
          Balu        1
          Chirag      1
Microsoft Abhay       1
          Balu        1
          Chirag      1

In [47]:
df.groupby("Company").describe()

          Sales                                                              \
          count        mean         std         min         25%         50%
Company
Facebook    3.0  354.340669  365.689660   89.381853  145.731247  202.080640
Google      3.0  259.799697   87.158009  163.333446  223.261226  283.189007
Microsoft   3.0  763.890604  391.785422  312.047889  641.254736  970.461584


                  75%          max
Company
Facebook   486.820077   771.559514
Google     308.032823   332.876639
Microsoft  989.811962  1009.162339

In [48]:
df.groupby("Company").describe().loc["Facebook"]

Sales  count      3.000000
       mean     354.340669
       std      365.689660
       min       89.381853
       25%      145.731247
       50%      202.080640
       75%      486.820077
       max      771.559514
Name: Facebook, dtype: float64